---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.ClipPlane.#ctor(Autodesk.Revit.DB.DirectContext3D.ClipPlane)
source: html/8b9bcc29-ed1c-5af4-e6e9-429022602d76.htm
---
# Autodesk.Revit.DB.DirectContext3D.ClipPlane.#ctor Method

Constructs a copy of the clip plane.

## Syntax (C#)
```csharp
public ClipPlane(
	ClipPlane other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.DirectContext3D.ClipPlane`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null